시리즈(series), 데이터프레임(DataFrame)

Series: index와 value가 함께 나옴. 1차원 배열(열벡터), 배열로부터 생성, 데이터 프레임으로부터 생성
        딕셔너리와 유사, 인덱스에 데이터가 매핑됨. 딕셔너리를 대신하여 사용이 가능함!

In [20]:
import pandas as pd
import numpy as np

In [4]:
obj = pd.Series([4,5,1,2])
obj.values
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = pd.Series([4,5,1,2],index = ['d','b','a','c'])

In [10]:
obj2

d    4
b    5
a    1
c    2
dtype: int64

In [11]:
obj2.a

1

In [12]:
obj2['a']

1

In [13]:
obj2['d'] = 6

In [15]:
obj2

d    6
b    5
a    1
c    2
dtype: int64

In [16]:
obj2[['c','a','d']]

c    2
a    1
d    6
dtype: int64

In [17]:
obj2[obj2>1]

d    6
b    5
c    2
dtype: int64

In [18]:
obj2>1

d     True
b     True
a    False
c     True
dtype: bool

In [22]:
np.exp(obj2)

d    403.428793
b    148.413159
a      2.718282
c      7.389056
dtype: float64

In [23]:
'b' in obj2

True

In [27]:
cdata = {'Seoul':1000,'Incheon':200, 'Busan':300,'Gwangju':100}
cdata
obj3 = pd.Series(cdata)
obj3

Seoul      1000
Incheon     200
Busan       300
Gwangju     100
dtype: int64

In [34]:
# dictionary -> series 생성
cdata2 = {'Suwon','Incheon', 'Busan','Gwangju'}
obj4 = pd.Series(cdata,index = cdata2) 
obj4
# Pandas에서는 누락값(NaN) 또는 NA라고 함.
# isnull, notnull함수를 이용하여 누락값을 찾을 수 있음.

Busan      300.0
Incheon    200.0
Suwon        NaN
Gwangju    100.0
dtype: float64

In [36]:
# Series를 구성하는 각각의 요소들에 대해 null인지 확인함.
pd.isnull(obj4)

Busan      False
Incheon    False
Suwon       True
Gwangju    False
dtype: bool

In [37]:
# Series 산술연산
obj3 + obj4  # index가 동일한 것들 끼리 연산됨. 자동으로 index가 오름차순 정렬됨.

Busan      600.0
Gwangju    200.0
Incheon    400.0
Seoul        NaN
Suwon        NaN
dtype: float64

In [42]:
obj4.name = 'population'
obj4

Busan      300.0
Incheon    200.0
Suwon        NaN
Gwangju    100.0
Name: population, dtype: float64

In [46]:
obj4.index.name = 'city'
obj4

city
Busan      300.0
Incheon    200.0
Suwon        NaN
Gwangju    100.0
Name: population, dtype: float64

In [51]:
obj.index = ['k','a','j','b']
obj

k    4
a    5
j    1
b    2
dtype: int64

In [55]:
# DataFrame: 서로 다른 종류의 데이터를 담을 수 있다.
# 원래 array는 data type이 모두 같음.
a = [1,2,3.14,'a']
a
arr = np.array(a)
arr

array(['1', '2', '3.14', 'a'], dtype='<U32')

In [56]:
# list와 array의 차이점
# list: data type이 달라도 넣기 가능
# array: data type이 문자로 바뀌어버림.
# DataFrame을 구성하는 열 하나하나는 열벡터라고도 부름. 즉 열벡터 단위 하나하나가 series로 이루어져 있음.

In [77]:
data = {'city':['Seoul','Daegu','Busan','Gwangju'], # 열벡터 -> series
       'year':[2000,2001,2002,2003],
       'pop':[0.9,0.2,0.3,0.1]} # 열벡터 -> series
df = pd.DataFrame(data)

In [78]:
df.city
df['city'] # data type: object(문자열, = string)
type(df['city']) # series!

pandas.core.series.Series

In [79]:
df.year # data type: int64 그러나 year의 요소 중 하나라도 object가 되면 'year' series의 data type은 object가 된다.

0    2000
1    2001
2    2002
3    2003
Name: year, dtype: int64

In [84]:
df['pop']
type(df['pop'])

pandas.core.series.Series

In [208]:
data = {'city':['Seoul','Daegu','Busan','Gwangju'], # 열벡터 -> series
       'year':[2000,2001,2002,2003],
       'pop':[0.9,0.2,0.3,0.1]} # 열벡터 -> series
df = pd.DataFrame(data, columns = ['year','city','pop']) # column이 나오는 순서 정해주기.
df

   year     city  pop
0  2000    Seoul  0.9
1  2001    Daegu  0.2
2  2002    Busan  0.3
3  2003  Gwangju  0.1

In [94]:
df2 = pd.DataFrame(data, columns = ['year','city','pop','location'],
                  index = ['one','two','three','four'])
df2

       year     city  pop location
one    2000    Seoul  0.9      NaN
two    2001    Daegu  0.2      NaN
three  2002    Busan  0.3      NaN
four   2003  Gwangju  0.1      NaN

In [102]:
# df2[0] # key error
# df2['two'] # key error

df2['year']  # 열 추출 시 column의 이름을 적으면 되지만.
df2.loc['two'] # 행 추출 시 .loc['two']와 같이 index를 불러라.

year         2001
city        Daegu
pop           0.2
location      NaN
Name: two, dtype: object

In [104]:
df2.iloc[0]  # 0번 행 추출

year         2000
city        Seoul
pop           0.9
location      NaN
Name: one, dtype: object

In [110]:
df3 = pd.DataFrame(data, columns = ['year','city','pop'], index = [10,11,12,13])
df3

    year     city  pop
10  2000    Seoul  0.9
11  2001    Daegu  0.2
12  2002    Busan  0.3
13  2003  Gwangju  0.1

In [113]:
df3.loc[11]  # label로 검색한다고 생각(행 index 이름)

year     2001
city    Daegu
pop       0.2
Name: 11, dtype: object

In [115]:
df3.iloc[1]  # index로 검색한다고 생각.

year     2001
city    Daegu
pop       0.2
Name: 11, dtype: object

In [122]:
df2['location'] = 126.0
df2['location'] = np.arange(4)
df2

       year     city  pop  location
one    2000    Seoul  0.9         0
two    2001    Daegu  0.2         1
three  2002    Busan  0.3         2
four   2003  Gwangju  0.1         3

In [127]:
val = pd.Series([10,12],index = ['one','three'])
# 추출방법
val.three
val.loc['three']
val.iloc[1]
val.iloc[-1]

12

In [128]:
df2['location'] = val

In [143]:
# df2['eastern'] = # True / False
(df2.city == 'Daegu') | (df2.city == 'Busan') # Daegu or Busan
df2['eastern'] = (df2.city == 'Daegu') | (df2.city == 'Busan')
df2

       year     city  pop  location  eastern
one    2000    Seoul  0.9      10.0    False
two    2001    Daegu  0.2       NaN     True
three  2002    Busan  0.3      12.0     True
four   2003  Gwangju  0.1       NaN    False

In [144]:
df2.columns
del df2['eastern']

In [145]:
df2

       year     city  pop  location
one    2000    Seoul  0.9      10.0
two    2001    Daegu  0.2       NaN
three  2002    Busan  0.3      12.0
four   2003  Gwangju  0.1       NaN

In [151]:
# 중첩된 딕셔너리 -> 데이터 프레임
# key -> 열 index
# 중첩 key -> 행 index
pop = {'Jeonju':{2001:30, 2002:35},
      'Daejeon':{2001:80, 2020:90}}
df5 = pd.DataFrame(pop)
df5

      Jeonju  Daejeon
2001    30.0     80.0
2002    35.0      NaN
2020     NaN     90.0

In [152]:
df5.T

         2001  2002  2020
Jeonju   30.0  35.0   NaN
Daejeon  80.0   NaN  90.0

In [159]:
df5.index.name = 'year'
df5
df5.columns.name = 'city'
df5

city  Jeonju  Daejeon
year
2001    30.0     80.0
2002    35.0      NaN
2020     NaN     90.0

In [160]:
df5.values # array 데이터로 나옴.

# DataFrame에 저장되어있는 데이터를 array로 추출하고자한다 
# -> DataFramename.values

array([[30., 80.],
       [35., nan],
       [nan, 90.]])

In [171]:
obj = pd.Series(range(11,14), index = ['a','b','c'])
index = obj.index
index[1:]
# index[1] = 'd' ->  Error

Index(['b', 'c'], dtype='object')

In [173]:
labels = pd.Index(np.arange(100,103))
labels

Int64Index([100, 101, 102], dtype='int64')

In [174]:
# label(레이블(y))
# x입력데이터  -> 모델  ->  y출력데이터(모델 예측값, yhat), 실제정답데이터(y)
# 그러니까 yhat == y ?

# label(라벨, 인덱스로 쓰임)

In [179]:
obj2 = pd.Series([1.0,-2.0,0],index = labels)
obj2.index is labels # 두개가 같냐?

True

In [186]:
'city' in df3.columns  # df3.columns에 city가 있냐?

True

In [187]:
11 in df3.index  # df3.index에 11이 있냐?

True

In [188]:
# 재색인(reindexing)
# data가 바뀌면서 index가 뒤죽박죽 섞이거나 없어지거나 난리남.
obj = pd.Series([4.1,7.1,-5.5,3.3], index = ['d','b','a','c'])
obj

d    4.1
b    7.1
a   -5.5
c    3.3
dtype: float64

In [195]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

TypeError: reindex() got an unexpected keyword argument "ethod"

In [192]:
# 시계열 데이터를 재색인 -> NaN 제거를 위해 보간을 하던가 채워넣는 작업을 해야함.
# 매출데이터
# 0801 100
# 0802 200
# 0803 NaN
# 0804 300
# 0805 100
# 결측값에 대해 회귀모델(주로 예측 목적)을 만들 수 있음. -> 회귀모델을 이용하여 0803 데이터 예측 가능.

In [200]:
obj3 = pd.Series(['data1','data2','data3'],index = [0,2,4])

obj3
obj3.reindex(range(5), method = 'ffill') # forward (위 -> 아래) 방향으로 채워넣는다(전파).
# index 1 -> 데이터가 없어서 위에 있는 data1을 채워넣음.
# index 3 -> 데이터가 없어서 위에 있는 data2를 채워넣음.

0    data1
1    data1
2    data2
3    data2
4    data3
dtype: object

In [202]:
obj3.reindex(range(5), method = 'bfill') # backward(아래 -> 위)방향으로 채워넣는다.

0    data1
1    data2
2    data2
3    data3
4    data3
dtype: object

In [210]:
df.loc[[0,2,3],'city']
df.loc[[0,2,3],['city','pop']]

      city  pop
0    Seoul  0.9
2    Busan  0.3
3  Gwangju  0.1

In [227]:
# 행 또는 열 삭제(drop)
obj = pd.Series(np.arange(11,16), index = ['a','b','c','d','e'])
# del obj['c']  del로 삭제
# newObj = obj.drop(['c','d'])  # drop으로 삭제
newObj

a    11
b    12
e    15
dtype: int32

In [231]:
data = pd.DataFrame(np.arange(16).reshape(4,4), 
                    index = ['Gwangju','Seoul','Jeju','Busan'], 
                    columns = ['one','two','three','four'])
data

         one  two  three  four
Gwangju    0    1      2     3
Seoul      4    5      6     7
Jeju       8    9     10    11
Busan     12   13     14    15

In [232]:
data.drop(['Seoul','Busan'])  # 해당 행 모두 삭제 (axis = 0)

         one  two  three  four
Gwangju    0    1      2     3
Jeju       8    9     10    11

In [238]:
data.drop(['two'],axis = 1)  # 해당 열 모두 삭제 (axis = 1)
# data = data.drop(['two'],axis = 'columns')  데이터 저장 방법
# data.drop(['two'],axis = 'columns',inplace=True)  데이터 저장 방법

         one  three  four
Gwangju    0      2     3
Seoul      4      6     7
Jeju       8     10    11
Busan     12     14    15